# PaperSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..PaperSize Property
PrintParameters Class See Also
---
The page size.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperSize PaperSize { get; set; }
```

Visual Basic
---
```text
Public Property PaperSize As PaperSize
	Get
	Set
```

Visual C++
---
```text
public:
property PaperSize^ PaperSize {
	PaperSize^ get ();
	void set (PaperSize^ value);
}
```

# Remarks
User can select the candidate via PaperSizes and then set the Page source of the Print Setting.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input argument is invalid for current printer. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace